{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "use_bias": true, "batch_input_shape": [null, 450, 450, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "strides": [1, 1], "trainable": true, "filters": 32, "name": "conv2d_1", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activation": "softmax", "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null}}]}