{"keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "kernel_regularizer": null, "trainable": true, "filters": 32, "batch_input_shape": [null, 450, 600, 3], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_regularizer": null, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "class_name": "Sequential", "backend": "tensorflow"}