{"keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 450, 450, 3], "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 1, "trainable": true, "use_bias": true, "activation": "softmax"}}], "backend": "tensorflow"}