{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "activation": "relu", "padding": "same", "name": "conv2d_1", "batch_input_shape": [null, 450, 450, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 1, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}], "keras_version": "2.2.2", "backend": "tensorflow"}