{"backend": "tensorflow", "keras_version": "2.2.5", "config": {"layers": [{"config": {"activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_1", "bias_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_size": [3, 3], "trainable": true, "batch_input_shape": [null, 64, 64, 3], "filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "dtype": "float32", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "filters": 16, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}