{"keras_version": "2.2.2", "config": [{"config": {"kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 100, 150, 3], "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "center": true, "trainable": true, "scale": true, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "units": 64}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "units": 128}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_3", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "units": 46}, "class_name": "Dense"}, {"config": {"kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "padding": "same", "name": "conv2d_2", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_4", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "trainable": true, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}