{"keras_version": "2.2.2", "config": [{"config": {"data_format": "channels_last", "name": "conv2d_1", "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "batch_input_shape": [null, 450, 600, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "batch_normalization_1", "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "trainable": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "conv2d_2", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "softmax", "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}