{"keras_version": "2.2.2", "config": [{"config": {"batch_input_shape": [null, 64, 64, 3], "padding": "valid", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "axis": -1, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_3", "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 16, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "units": 64, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "units": 10, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null, "units": 1, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}