{"keras_version": "2.2.2", "config": [{"config": {"activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "filters": 64, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "padding": "valid", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "filters": 32, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "trainable": true, "center": true, "beta_regularizer": null, "scale": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "filters": 16, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "units": 64, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "units": 128, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_3", "kernel_regularizer": null, "units": 10, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "name": "dense_4", "kernel_regularizer": null, "units": 1, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}