{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "batch_input_shape": [null, 450, 600, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "relu", "filters": 64, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "relu", "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "name": "dense_1", "units": 1, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}