{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "dtype": "float32", "padding": "valid", "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 64, "batch_input_shape": [null, 100, 150, 3], "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "linear", "name": "conv2d_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1, "center": true, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "filters": 16, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "name": "conv2d_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "bias_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "bias_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_3", "bias_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "dense_4", "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.2.2"}