{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 32, "batch_input_shape": [null, 450, 300, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1", "scale": true, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "use_bias": true, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.2"}