{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"filters": 64, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "activation": "relu", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_2", "activation": "linear", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_1", "scale": true, "gamma_regularizer": null, "axis": -1, "trainable": true, "gamma_constraint": null, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"filters": 16, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_3", "activation": "relu", "trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 64, "name": "dense_1", "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 128, "name": "dense_2", "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 10, "name": "dense_3", "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1, "name": "dense_4", "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}