{"config": [{"config": {"activation": "relu", "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "filters": 32, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"axis": -1, "center": true, "gamma_constraint": null, "momentum": 0.99, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "filters": 16, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "sigmoid", "units": 64, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "units": 128, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "units": 10, "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "units": 1, "activity_regularizer": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}