{"class_name": "Sequential", "keras_version": "2.2.5", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_constraint": null, "batch_input_shape": [null, 64, 64, 3], "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1", "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_1", "axis": -1}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_3", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "dtype": "float32"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 64, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 128, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 10, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_3", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_4", "kernel_regularizer": null}}]}}